NextFOAM-2606/tutorials/lagrangian/reactingParcelFoam/airRecirculationRoom/steady/Allrun.pre
#!/bin/sh
cd "${0%/*}" || exit                                # Run from this directory
. ${WM_PROJECT_DIR:?}/bin/tools/RunFunctions        # Tutorial run functions
#------------------------------------------------------------------------------

restore0Dir

runApplication blockMesh

mkdir -p constant/triSurface

cp -f "$FOAM_TUTORIALS"/resources/geometry/roomRecirculation.stl.gz \
    constant/triSurface

runApplication surfaceFeatureExtract

runApplication snappyHexMesh -overwrite

#------------------------------------------------------------------------------
